; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph2 - mode
	thermograph3 - mode
	spectrograph4 - mode
	spectrograph7 - mode
	spectrograph5 - mode
	spectrograph6 - mode
	spectrograph0 - mode
	infrared1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph5)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph4)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph6)
	(supports instrument1 spectrograph7)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Planet8 spectrograph2)
	(have_image Planet8 infrared1)
	(have_image Star9 spectrograph6)
	(have_image Planet10 spectrograph6)
	(have_image Planet11 infrared1)
	(have_image Planet11 spectrograph4)
	(have_image Star12 spectrograph0)
	(have_image Star12 spectrograph2)
	(have_image Star13 spectrograph5)
	(have_image Star13 spectrograph2)
	(have_image Star14 spectrograph7)
	(have_image Star14 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation3 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 13
3. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 13
4. (turn_to satellite0 star13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star13)
   goals met: 0 of 13
5. (take_image satellite0 star13 instrument0 spectrograph5)
   added: (have_image star13 spectrograph5)
   goals met: 1 of 13
6. (take_image satellite0 star13 instrument0 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 2 of 13
7. (turn_to satellite0 star12 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star12)
   goals met: 2 of 13
8. (take_image satellite0 star12 instrument0 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 3 of 13
9. (take_image satellite0 star12 instrument0 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 4 of 13
10. (turn_to satellite0 planet8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet8)
   goals met: 4 of 13
11. (take_image satellite0 planet8 instrument0 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 5 of 13
12. (turn_to satellite0 groundstation3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation3)
   goals met: 6 of 13
13. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 13
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 13
15. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 6 of 13
16. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   goals met: 5 of 13
17. (take_image satellite0 planet10 instrument1 spectrograph6)
   added: (have_image planet10 spectrograph6)
   goals met: 6 of 13
18. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 6 of 13
19. (take_image satellite0 planet11 instrument1 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 7 of 13
20. (take_image satellite0 planet11 instrument1 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 8 of 13
21. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 8 of 13
22. (take_image satellite0 planet8 instrument1 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 9 of 13
23. (turn_to satellite0 star14 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star14)
   goals met: 9 of 13
24. (take_image satellite0 star14 instrument1 infrared1)
   added: (have_image star14 infrared1)
   goals met: 10 of 13
25. (take_image satellite0 star14 instrument1 spectrograph7)
   added: (have_image star14 spectrograph7)
   goals met: 11 of 13
26. (turn_to satellite0 star9 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star9)
   goals met: 11 of 13
27. (take_image satellite0 star9 instrument1 spectrograph6)
   added: (have_image star9 spectrograph6)
   goals met: 12 of 13
28. (turn_to satellite0 groundstation3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation3)
   goals met: 13 of 13
